#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_subnetwork.jade-subnetwork will be updated in-place
  ~ resource "google_compute_subnetwork" "jade-subnetwork" {
        creation_timestamp       = "2019-04-10T09:20:35.504-07:00"
        enable_flow_logs         = false
        fingerprint              = "SIHbUv475PQ="
        gateway_address          = "10.0.0.1"
        id                       = "us-central1/integration-subnet"
        ip_cidr_range            = "10.0.0.0/22"
        name                     = "integration-subnet"
        network                  = "https://www.googleapis.com/compute/v1/projects/broad-jade-integration/global/networks/integration-network"
        private_ip_google_access = true
        project                  = "broad-jade-integration"
        region                   = "us-central1"
      ~ secondary_ip_range       = [
          ~ {
              ~ ip_cidr_range = "10.24.0.0/14" -> "10.48.0.0/14"
              ~ range_name    = "gke-integration-master-pods-0d110986" -> "pods"
            },
          ~ {
              ~ ip_cidr_range = "10.0.32.0/20" -> "10.0.16.0/20"
              ~ range_name    = "gke-integration-master-services-0d110986" -> "services"
            },
        ]
        self_link                = "https://www.googleapis.com/compute/v1/projects/broad-jade-integration/regions/us-central1/subnetworks/integration-subnet"

        timeouts {}
    }

  # module.k8s-master.google_container_cluster.cluster must be replaced
-/+ resource "google_container_cluster" "cluster" {
      + additional_zones            = (known after apply)
      ~ cluster_ipv4_cidr           = "10.24.0.0/14" -> (known after apply)
      ~ default_max_pods_per_node   = 110 -> (known after apply)
        enable_binary_authorization = false
        enable_intranode_visibility = false
        enable_kubernetes_alpha     = false
        enable_legacy_abac          = false
        enable_shielded_nodes       = false
        enable_tpu                  = false
      ~ endpoint                    = "35.192.65.0" -> (known after apply)
      ~ id                          = "projects/broad-jade-integration/locations/us-central1/clusters/integration-master" -> (known after apply)
        initial_node_count          = 1
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/beta/projects/broad-jade-integration/zones/us-central1-c/instanceGroups/gke-integration-mast-integration-node-d21a1883-grp",
          - "https://www.googleapis.com/compute/beta/projects/broad-jade-integration/zones/us-central1-b/instanceGroups/gke-integration-mast-integration-node-5943413a-grp",
          - "https://www.googleapis.com/compute/beta/projects/broad-jade-integration/zones/us-central1-a/instanceGroups/gke-integration-mast-integration-node-9d066961-grp",
        ] -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
        location                    = "us-central1"
        logging_service             = "logging.googleapis.com/kubernetes"
      ~ master_version              = "1.15.11-gke.5" -> (known after apply)
      ~ min_master_version          = "1.15.11-gke.5" -> "1.15.9-gke.24"
        monitoring_service          = "monitoring.googleapis.com/kubernetes"
        name                        = "integration-master"
      ~ network                     = "projects/broad-jade-integration/global/networks/integration-network" -> "integration-network"
      ~ node_locations              = [
          - "us-central1-a",
          - "us-central1-b",
          - "us-central1-c",
        ] -> (known after apply)
      ~ node_version                = "1.15.9-gke.24" -> (known after apply)
      + operation                   = (known after apply)
      ~ project                     = "broad-jade-integration" -> (known after apply)
      + region                      = (known after apply)
        remove_default_node_pool    = true
      - resource_labels             = {} -> null
      ~ services_ipv4_cidr          = "10.0.32.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/broad-jade-integration/regions/us-central1/subnetworks/integration-subnet" -> "integration-subnet"
      + tpu_ipv4_cidr_block         = (known after apply)
      + zone                        = (known after apply)

      ~ addons_config {
          + cloudrun_config {
              + disabled = (known after apply)
            }

          + dns_cache_config {
              + enabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + http_load_balancing {
              + disabled = (known after apply)
            }

          + istio_config {
              + disabled = true
            }

          + kubernetes_dashboard {
              + disabled = (known after apply)
            }

            network_policy_config {
                disabled = false
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      ~ cluster_autoscaling {
          ~ autoscaling_profile = "BALANCED" -> (known after apply)
          ~ enabled             = false -> (known after apply)

          + auto_provisioning_defaults {
              + oauth_scopes    = (known after apply)
              + service_account = (known after apply)
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      ~ database_encryption {
          + key_name = (known after apply)
          ~ state    = "DECRYPTED" -> (known after apply)
        }

      ~ ip_allocation_policy {
          ~ cluster_ipv4_cidr_block       = "10.24.0.0/14" -> (known after apply)
          ~ cluster_secondary_range_name  = "gke-integration-master-pods-0d110986" -> "pods" # forces replacement
          + node_ipv4_cidr_block          = (known after apply)
          ~ services_ipv4_cidr_block      = "10.0.32.0/20" -> (known after apply)
          ~ services_secondary_range_name = "gke-integration-master-services-0d110986" -> "services" # forces replacement
          + subnetwork_name               = (known after apply)
        }

      ~ master_auth {
          ~ client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMyakNDQWNLZ0F3SUJBZ0lRRHl6UnlQWkhMYUxnY3BkVWI2ZFovekFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlSaFpHUTNOVE00WXkweE5qRmtMVFEzT1dNdFlUZGpaQzA0WWpKaFpETmpPVFF5TWpVdwpIaGNOTWpBd01qSTNNakF6TURRMldoY05NalV3TWpJMU1qQXpNRFEyV2pBUk1ROHdEUVlEVlFRREV3WmpiR2xsCmJuUXdnZ0VpTUEwR0NTcUdTSWIzRFFFQkFRVUFBNElCRHdBd2dnRUtBb0lCQVFESmNCMmN6Q21mclVZbi9yYTIKTlpIUEpMYVRqcndtN20ya0xLYkZlVXQvc1VYMTU1Y1ljcjI2Mkdpc1hjR0lubGwxYTFOYnBSYkdKSS9Wa05jLwpLb0pNUG94STkvR1lDY2huNnZYYS9mYXhBSmxwQi9NelZwbC9ZMjE1VU1uaUU4b292RktpOG1iMEF2ZlV3eHVUCnliRDVpUUtnaVBkb1V6QlUvUTZqcEw0VlJ6SDFPcHh2a3lGQ1cyb0J0WG9uNGxNamJibWx1aVRBeWJxdjZhWFEKenVtZHNNNnZjcnN1TGFrT0p3MCtZL0hNNGUvMTB6UXNpQWdkb1A0MzNBYUNIeGdINk9VTXdPWFBlQ0p3aUJhUQpBT3hBeWcvNGxuOEtZSVJCTEpxR0c4aUxOUktHZVFGbzh4TkhJR0Y0WUgza081T1pIVlFPQWJBZXJrZ2N4R3RpClV0OUJBZ01CQUFHakVEQU9NQXdHQTFVZEV3RUIvd1FDTUFBd0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFEQ2EKbmVzdk9rNzRZN051MUlvYzljVXFZSm1iQXdqY2xoUVZ2WUFqeWJveGgyZklVRTNzNWRkbVhsYXRxS2RxV2JuSQpuNE5qM0Rzc0oyckQyc3FxSDNoU3dHbEwrVFVYOHVPV1hsVUJDcURVZkszZFpVdWh2bTNMVkRRdzVyWnNPME9ZCktWRE9MTnIxTnh5MFdScm8wTEFkRFBnY0NRc3JmN2JiTXRxbnpKNFgyREJNaXU0czN0RDIydTlVaHV0VGVJRWkKTE5sMnc3VGcrQ1hLRUcyK1VGUTZKVUtLVENXRnM0dk5SS1hQT1dyRUtjVWNIY3NiZWcyajBpNjF1dnRqeXNoWAozV3g5cnFkQTNSb2FYc0NvWE5xYUs5aHY3YlBqVFBGK1RLWmZUUkwrTG91elVPZVZqeHZ1NnpJSzBEMTJOUXdCCmRPWkJZMktNZGFkc1grMnlNTzg9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)
          ~ client_key             = (sensitive value)
          ~ cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURDekNDQWZPZ0F3SUJBZ0lRS2dCRFA1bEdNekllSTB3M0lBZ0RSekFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlSaFpHUTNOVE00WXkweE5qRmtMVFEzT1dNdFlUZGpaQzA0WWpKaFpETmpPVFF5TWpVdwpIaGNOTWpBd01qSTNNVGt6TURRMVdoY05NalV3TWpJMU1qQXpNRFExV2pBdk1TMHdLd1lEVlFRREV5UmhaR1EzCk5UTTRZeTB4TmpGa0xUUTNPV010WVRkalpDMDRZakpoWkROak9UUXlNalV3Z2dFaU1BMEdDU3FHU0liM0RRRUIKQVFVQUE0SUJEd0F3Z2dFS0FvSUJBUURZRFJXVG5FZVBJYVhuMnI5dTZ0em1mVDEyYi9WSzBpL0Z6K2tYUlZaYwp1UmlaMDkyRGpCOGpQY0k3UXFiYWJkY055QVBybm5nNEthZG53WXBRY2I5RGJJOWtoNVc2YStiTXRlWDZrNjJCCmd2LzlnM3VwV3dQVGpCckNXUzN1SEhUUENGVDN6bUtXYk1jMkVIaFo4MFBiN1Y0eVYzem0yUzNzY3JhcENKamcKYlIxOE5ESitJRnVZZkxobGF3U29HcFBVYi9oVWNJalJ1YUN2ZXFLN0tFbDBPbmwvN0dGMEJqOFJFczJLeEFaYQoyaEcrK2tQUmlrdzBiWlJDVFhnNjRGNzM3aE1JNGJoN2FEUnV2dVdUOTdDU0ZLZG1HaEVwTU1mcTBqaGJmcmJoCnA5c2REV002Y1EwTjVxRWF5YWxySEE4YUNjdEVqdlNWOHBkR3NnZlpZN2V2QWdNQkFBR2pJekFoTUE0R0ExVWQKRHdFQi93UUVBd0lDQkRBUEJnTlZIUk1CQWY4RUJUQURBUUgvTUEwR0NTcUdTSWIzRFFFQkN3VUFBNElCQVFCWgpiNnR2bHJOTkdCNnZuUHVjRmlzSGFCam56RXlMUlowOVFQM0VzUndyTndZNWFqbld2djF5MjhIRXVxNkR4QTB5CjAyWjEzVTFKeWpPZkIzcWlFK29rTXRYNTh3VVZmZEJxTWFENFlRZ1dTZVdiVDZQc2hrdUV3MkZiaCtESTZJeWkKaFhoZXNPWHA5clJMQ0VMTGtNeW1ZUE1IdEF3bVd6d3VlY1pxTm54Y1R6NmNMVS9vUlRsY01YSTcvT2VKSWoySgpubkE1Z1FWTDNLSEEybkd5MXJyazBTUjR2TkVqRE9xSXkxMUZLUWFkSExUKzYxWjladnFYd3AzUUpOb2pRcUV5CkR1YVovSFVXVTFndTB0S3FrQXI2c0JtRWdiT3ZJQ2tFSml0T2xIMGphNG9lSU1ZWU4xUEFqb2U4TmNQemcvek8KTVpFeFE0ZEhkcTJGeU1jVGoyck0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)

            client_certificate_config {
                issue_client_certificate = true
            }
        }

      ~ master_authorized_networks_config {
          - cidr_blocks {
              - cidr_block = "13.90.230.208/32" -> null
            }
            cidr_blocks {
                cidr_block = "69.173.112.0/21"
            }
            cidr_blocks {
                cidr_block = "69.173.120.0/22"
            }
            cidr_blocks {
                cidr_block = "69.173.124.0/23"
            }
            cidr_blocks {
                cidr_block = "69.173.126.0/24"
            }
            cidr_blocks {
                cidr_block = "69.173.127.0/25"
            }
            cidr_blocks {
                cidr_block = "69.173.127.128/26"
            }
            cidr_blocks {
                cidr_block = "69.173.127.192/27"
            }
            cidr_blocks {
                cidr_block = "69.173.127.224/30"
            }
            cidr_blocks {
                cidr_block = "69.173.127.228/32"
            }
            cidr_blocks {
                cidr_block = "69.173.127.230/31"
            }
            cidr_blocks {
                cidr_block = "69.173.127.232/29"
            }
            cidr_blocks {
                cidr_block = "69.173.127.240/28"
            }
            cidr_blocks {
                cidr_block = "69.173.64.0/19"
            }
            cidr_blocks {
                cidr_block = "69.173.96.0/20"
            }
        }

      ~ network_policy {
            enabled = true
        }

      ~ node_config {
          + boot_disk_kms_key = (known after apply)
          ~ disk_size_gb      = 50 -> (known after apply)
          ~ disk_type         = "pd-standard" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS" -> (known after apply)
          ~ labels            = {
              - "environment" = "integration"
              - "project"     = "jade"
            } -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "n1-standard-2" -> (known after apply)
          ~ metadata          = {
              - "disable-legacy-endpoints"         = "true"
              - "google-compute-enable-virtio-rng" = "false"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          ~ oauth_scopes      = [
              - "https://www.googleapis.com/auth/compute",
              - "https://www.googleapis.com/auth/devstorage.read_only",
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
            ] -> (known after apply)
          ~ preemptible       = false -> (known after apply)
          ~ service_account   = "default" -> (known after apply)
          ~ tags              = [
              - "jade",
              - "integration",
              - "kubernetes",
            ] -> (known after apply)
          ~ taint             = [] -> (known after apply)

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

          ~ workload_metadata_config {
              ~ node_metadata = "SECURE" -> (known after apply)
            }
        }

      ~ node_pool {
          ~ initial_node_count  = 1 -> (known after apply)
          ~ instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/broad-jade-integration/zones/us-central1-c/instanceGroupManagers/gke-integration-mast-integration-node-d21a1883-grp",
              - "https://www.googleapis.com/compute/v1/projects/broad-jade-integration/zones/us-central1-b/instanceGroupManagers/gke-integration-mast-integration-node-5943413a-grp",
              - "https://www.googleapis.com/compute/v1/projects/broad-jade-integration/zones/us-central1-a/instanceGroupManagers/gke-integration-mast-integration-node-9d066961-grp",
            ] -> (known after apply)
          ~ max_pods_per_node   = 110 -> (known after apply)
          ~ name                = "integration-node" -> (known after apply)
          + name_prefix         = (known after apply)
          ~ node_count          = 1 -> (known after apply)
          ~ node_locations      = [
              - "us-central1-a",
              - "us-central1-b",
              - "us-central1-c",
            ] -> (known after apply)
          ~ version             = "1.15.9-gke.24" -> (known after apply)

          + autoscaling {
              + max_node_count = (known after apply)
              + min_node_count = (known after apply)
            }

          ~ management {
              ~ auto_repair  = true -> (known after apply)
              ~ auto_upgrade = true -> (known after apply)
            }

          ~ node_config {
              + boot_disk_kms_key = (known after apply)
              ~ disk_size_gb      = 50 -> (known after apply)
              ~ disk_type         = "pd-standard" -> (known after apply)
              ~ guest_accelerator = [] -> (known after apply)
              ~ image_type        = "COS" -> (known after apply)
              ~ labels            = {
                  - "environment" = "integration"
                  - "project"     = "jade"
                } -> (known after apply)
              ~ local_ssd_count   = 0 -> (known after apply)
              ~ machine_type      = "n1-standard-2" -> (known after apply)
              ~ metadata          = {
                  - "disable-legacy-endpoints"         = "true"
                  - "google-compute-enable-virtio-rng" = "false"
                } -> (known after apply)
              + min_cpu_platform  = (known after apply)
              ~ oauth_scopes      = [
                  - "https://www.googleapis.com/auth/compute",
                  - "https://www.googleapis.com/auth/devstorage.read_only",
                  - "https://www.googleapis.com/auth/logging.write",
                  - "https://www.googleapis.com/auth/monitoring",
                ] -> (known after apply)
              ~ preemptible       = false -> (known after apply)
              ~ service_account   = "default" -> (known after apply)
              ~ tags              = [
                  - "jade",
                  - "integration",
                  - "kubernetes",
                ] -> (known after apply)
              ~ taint             = [] -> (known after apply)

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              ~ shielded_instance_config {
                  ~ enable_integrity_monitoring = true -> (known after apply)
                  ~ enable_secure_boot          = false -> (known after apply)
                }

              ~ workload_metadata_config {
                  ~ node_metadata = "SECURE" -> (known after apply)
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

        pod_security_policy_config {
            enabled = true
        }

      ~ private_cluster_config {
          - enable_private_endpoint = false -> null
            enable_private_nodes    = true
            master_ipv4_cidr_block  = "10.227.0.0/28"
          ~ peering_name            = "gke-n1035e4415d5bed2d558-a4ec-de3e-peer" -> (known after apply)
          ~ private_endpoint        = "10.227.0.2" -> (known after apply)
          ~ public_endpoint         = "35.192.65.0" -> (known after apply)
        }

      ~ release_channel {
          ~ channel = "UNSPECIFIED" -> "REGULAR" # forces replacement
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions to validate/plan TF files`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
